{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "input_14", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_14"}, "inbound_nodes": []}, {"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "input_17", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_17"}, "inbound_nodes": []}, {"name": "input_18", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_18"}, "inbound_nodes": []}, {"name": "input_19", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_19"}, "inbound_nodes": []}, {"name": "input_20", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_20"}, "inbound_nodes": []}, {"name": "input_21", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_21"}, "inbound_nodes": []}, {"name": "input_22", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_22"}, "inbound_nodes": []}, {"name": "input_23", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_23"}, "inbound_nodes": []}, {"name": "input_24", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_24"}, "inbound_nodes": []}, {"name": "embedding_13", "class_name": "Embedding", "config": {"name": "embedding_13", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 22188, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "embedding_14", "class_name": "Embedding", "config": {"name": "embedding_14", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 3916, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"name": "embedding_15", "class_name": "Embedding", "config": {"name": "embedding_15", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 436, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "embedding_16", "class_name": "Embedding", "config": {"name": "embedding_16", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 4372, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "embedding_17", "class_name": "Embedding", "config": {"name": "embedding_17", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 37, "output_dim": 18, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "embedding_18", "class_name": "Embedding", "config": {"name": "embedding_18", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 2, "output_dim": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_18", 0, 0, {}]]]}, {"name": "embedding_19", "class_name": "Embedding", "config": {"name": "embedding_19", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 12, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"name": "embedding_20", "class_name": "Embedding", "config": {"name": "embedding_20", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 6, "output_dim": 3, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "embedding_21", "class_name": "Embedding", "config": {"name": "embedding_21", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 15, "output_dim": 7, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_21", 0, 0, {}]]]}, {"name": "embedding_22", "class_name": "Embedding", "config": {"name": "embedding_22", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 199, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_22", 0, 0, {}]]]}, {"name": "embedding_23", "class_name": "Embedding", "config": {"name": "embedding_23", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 474, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_23", 0, 0, {}]]]}, {"name": "embedding_24", "class_name": "Embedding", "config": {"name": "embedding_24", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 535, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["input_24", 0, 0, {}]]]}, {"name": "reshape_13", "class_name": "Reshape", "config": {"name": "reshape_13", "trainable": true, "dtype": "float32", "target_shape": [50]}, "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"name": "reshape_14", "class_name": "Reshape", "config": {"name": "reshape_14", "trainable": true, "dtype": "float32", "target_shape": [50]}, "inbound_nodes": [[["embedding_14", 0, 0, {}]]]}, {"name": "reshape_15", "class_name": "Reshape", "config": {"name": "reshape_15", "trainable": true, "dtype": "float32", "target_shape": [50]}, "inbound_nodes": [[["embedding_15", 0, 0, {}]]]}, {"name": "reshape_16", "class_name": "Reshape", "config": {"name": "reshape_16", "trainable": true, "dtype": "float32", "target_shape": [50]}, "inbound_nodes": [[["embedding_16", 0, 0, {}]]]}, {"name": "reshape_17", "class_name": "Reshape", "config": {"name": "reshape_17", "trainable": true, "dtype": "float32", "target_shape": [18]}, "inbound_nodes": [[["embedding_17", 0, 0, {}]]]}, {"name": "reshape_18", "class_name": "Reshape", "config": {"name": "reshape_18", "trainable": true, "dtype": "float32", "target_shape": [1]}, "inbound_nodes": [[["embedding_18", 0, 0, {}]]]}, {"name": "reshape_19", "class_name": "Reshape", "config": {"name": "reshape_19", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_19", 0, 0, {}]]]}, {"name": "reshape_20", "class_name": "Reshape", "config": {"name": "reshape_20", "trainable": true, "dtype": "float32", "target_shape": [3]}, "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"name": "reshape_21", "class_name": "Reshape", "config": {"name": "reshape_21", "trainable": true, "dtype": "float32", "target_shape": [7]}, "inbound_nodes": [[["embedding_21", 0, 0, {}]]]}, {"name": "reshape_22", "class_name": "Reshape", "config": {"name": "reshape_22", "trainable": true, "dtype": "float32", "target_shape": [50]}, "inbound_nodes": [[["embedding_22", 0, 0, {}]]]}, {"name": "reshape_23", "class_name": "Reshape", "config": {"name": "reshape_23", "trainable": true, "dtype": "float32", "target_shape": [50]}, "inbound_nodes": [[["embedding_23", 0, 0, {}]]]}, {"name": "reshape_24", "class_name": "Reshape", "config": {"name": "reshape_24", "trainable": true, "dtype": "float32", "target_shape": [50]}, "inbound_nodes": [[["embedding_24", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["reshape_13", 0, 0, {}], ["reshape_14", 0, 0, {}], ["reshape_15", 0, 0, {}], ["reshape_16", 0, 0, {}], ["reshape_17", 0, 0, {}], ["reshape_18", 0, 0, {}], ["reshape_19", 0, 0, {}], ["reshape_20", 0, 0, {}], ["reshape_21", 0, 0, {}], ["reshape_22", 0, 0, {}], ["reshape_23", 0, 0, {}], ["reshape_24", 0, 0, {}]]]}, {"name": "dense_8", "class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.35, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"name": "dense_9", "class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"name": "dropout_10", "class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"name": "dropout_11", "class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_12", 0, 0, {}]]]}, {"name": "dense_13", "class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"name": "dropout_12", "class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0], ["input_14", 0, 0], ["input_15", 0, 0], ["input_16", 0, 0], ["input_17", 0, 0], ["input_18", 0, 0], ["input_19", 0, 0], ["input_20", 0, 0], ["input_21", 0, 0], ["input_22", 0, 0], ["input_23", 0, 0], ["input_24", 0, 0]], "output_layers": [["dense_14", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}